UKS/src/Catalogs/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оборудование</name>
  <comment>Оборудование</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <comment>Инвентарныйномер</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размещение</name>
    <comment>Размещение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИПАдрес</name>
    <comment>ИП адрес принтера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <comment>Логин</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <comment>Пароль</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <comment>Изготвитель</comment>
    <type>
      <types>CatalogRef.Изготовители</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <comment>Вид оборудования</comment>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриобритения</name>
    <comment>Дата покупки оборудования</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Списан</name>
    <comment>Списан</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСписания</name>
    <comment>Дата списания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

UKS/src/InformationRegisters/ОтветственныеЛицаОборудования/ОтветственныеЛицаОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛицаОборудования</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <comment>Оборудование</comment>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UKS/src/Catalogs/Оборудование/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Ключ.Пустая() Тогда
		СписокОбслуживания.Параметры.УстановитьЗначениеПараметра("Оборудование",Справочники.Оборудование.ПустаяСсылка());	
	Иначе
		СписокОбслуживания.Параметры.УстановитьЗначениеПараметра("Оборудование",Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаИсторияОтветственныхЛицНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаИсторияОтветственныхЛиц(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		Записать();
	КонецЕсли;
	 
	ПараметрыОткрытия = Новый Структура;
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Период",ТекущаяДата());
	ПараметрыЗаполнения.Вставить("Оборудование",Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения",ПараметрыЗаполнения);
	ОткрытьФорму(
				"РегистрСведений.ОтветственныеЛицаОборудования.ФормаСписка",
				ПараметрыОткрытия,
				ЭтаФорма,
				,,,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Процедура КомандаНовыйОтветственноеЛицоНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаНовыйОтветственноеЛицо(Команда)
	//КомандаНовыйОтветственноеЛицоНаСервере();
	
	Если Параметры.Ключ.Пустая() Тогда
		Записать();
	КонецЕсли;
	 
	ПараметрыОткрытия = Новый Структура;
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Период",ТекущаяДата());
	ПараметрыЗаполнения.Вставить("Оборудование",Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения",ПараметрыЗаполнения);
	ОткрытьФорму(
				"РегистрСведений.ОтветственныеЛицаОборудования.ФормаЗаписи",
				ПараметрыОткрытия,
				ЭтаФорма,
				,,,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия="Новый_ОтветственноеЛицо") И (Источник = ЭтаФорма) Тогда
		Объект.ОтветственноеЛицо = Параметр.Сотрудник;
		Модифицированность = Истина;
		Записать();
	КонецЕсли;
	
КонецПроцедуры
